# import libraries

In [1]:
import pandas as pd
import numpy as np
import os

# import dataframe

In [2]:
path = r'/Users/tayen/Documents/CF/Instacart Basket Analysis/02 Data/'

In [3]:
df_ords = pd.read_csv(os.path.join(path,'Original Data','orders.csv'),index_col = False)

In [4]:
df_prods = pd.read_csv(os.path.join(path,'Original Data','products.csv'),index_col = False)

# step 1

In [5]:
# drop irrelvant column
df_ords = df_ords.drop(columns = ['eval_set'])

In [6]:
df_ords.head()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

In [7]:
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [8]:
# check missing data
df_ords['days_since_prior_order'].value_counts(dropna = False)

30.0    369323
7.0     320608
6.0     240013
4.0     221696
3.0     217005
5.0     214503
NaN     206209
2.0     193206
8.0     181717
1.0     145247
9.0     118188
14.0    100230
10.0     95186
13.0     83214
11.0     80970
12.0     76146
0.0      67755
15.0     66579
16.0     46941
21.0     45470
17.0     39245
20.0     38527
18.0     35881
19.0     34384
22.0     32012
28.0     26777
23.0     23885
27.0     22013
24.0     20712
25.0     19234
29.0     19191
26.0     19016
Name: days_since_prior_order, dtype: int64

In [9]:
df_prods['department_id'].value_counts(dropna = False)

11    6565
19    6264
13    5371
7     4365
1     4007
16    3449
17    3085
15    2092
9     1858
4     1684
3     1516
20    1322
21    1258
6     1139
14    1116
18    1081
5     1056
8      972
12     907
2      548
10      38
Name: department_id, dtype: int64

# step 2

In [10]:
# reset columns data type
df_ords['order_id'] = df_ords['order_id'].astype('str')

In [11]:
df_ords['user_id'] = df_ords['user_id'].astype('str')

In [12]:
df_ords['order_number'] = df_ords['order_number'].astype('str')

In [13]:
df_ords['days_since_prior_order'] = df_ords['days_since_prior_order'].astype('Int64')

In [14]:
df_ords.dtypes

order_id                  object
user_id                   object
order_number              object
order_dow                  int64
order_hour_of_day          int64
days_since_prior_order     Int64
dtype: object

# step 3

In [15]:
# rename culomns
df_ords.rename(columns = {'order_dow':'order_day_of_week'},inplace = False)

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,<NA>
1,2398795,1,2,3,7,15
2,473747,1,3,3,12,21
3,2254736,1,4,4,7,29
4,431534,1,5,4,15,28
...,...,...,...,...,...,...
3421078,2266710,206209,10,5,18,29
3421079,1854736,206209,11,4,10,30
3421080,626363,206209,12,1,12,18
3421081,2977660,206209,13,1,12,7
3421082,272231,206209,14,6,14,30

In [16]:
df_ords.rename(columns ={'order_number':'order_count'},inplace = False)

,order_id,user_id,order_count,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,<NA>
1,2398795,1,2,3,7,15
2,473747,1,3,3,12,21
3,2254736,1,4,4,7,29
4,431534,1,5,4,15,28
...,...,...,...,...,...,...
3421078,2266710,206209,10,5,18,29
3421079,1854736,206209,11,4,10,30
3421080,626363,206209,12,1,12,18
3421081,2977660,206209,13,1,12,7
3421082,272231,206209,14,6,14,30

# step 4

In [17]:
df_ords['order_hour_of_day'].value_counts(dropna = False)

10    288418
11    284728
15    283639
14    283042
13    277999
12    272841
16    272553
9     257812
17    228795
18    182912
8     178201
19    140569
20    104292
7      91868
21     78109
22     61468
23     40043
6      30529
0      22758
1      12398
5       9569
2       7539
4       5527
3       5474
Name: order_hour_of_day, dtype: int64

### 10 to 16 are the busiest hours of a day, 10 is the on the crest of the wave.

# step 5

In [5]:
df_dpts = pd.read_csv(os.path.join(path,'Original Data','departments.csv'),index_col = False)

In [6]:
df_dpts.head()

,department_id,1,2,3,4,5,6,7,8,9,...,12,13,14,15,16,17,18,19,20,21
0,department,frozen,other,bakery,produce,alcohol,international,beverages,pets,dry goods pasta,...,meat seafood,pantry,breakfast,canned goods,dairy eggs,household,babies,snacks,deli,missing

In [7]:
df_dpts_wide = df_dpts

In [8]:
df_dpts = df_dpts_wide.T

In [10]:
df_dpts.head(25)

                             0
department_id       department
1                       frozen
2                        other
3                       bakery
4                      produce
5                      alcohol
6                international
7                    beverages
8                         pets
9              dry goods pasta
10                        bulk
11               personal care
12                meat seafood
13                      pantry
14                   breakfast
15                canned goods
16                  dairy eggs
17                   household
18                      babies
19                      snacks
20                        deli
21                     missing

In [ ]:
# reset index
df_dpts.reset_index()

In [ ]:
# duplicate index 0 as header
new_header = df_dpts.iloc[0]

In [ ]:
# truncate index 1: as new dataframe
df_dpts_new = df_dpts[1:]

In [ ]:
# set header
df_dpts_new.columns = new_header

In [ ]:
df_dpts_new.head()

In [ ]:
dpt_dict = df_dpts_new.to_dict('index')

In [ ]:
dpt_dict.get('4')

# step 6

In [ ]:
print(dpt_dict)

In [ ]:
df_prods['department_id'] == 14

In [ ]:
df_breakfast = df_prods[df_prods['department_id'] == 14]

In [ ]:
df_breakfast.head()

# step 7

In [ ]:
df_dinnerparty = df_prods.loc[df_prods['department_id'].isin([5,7,12,20])]

In [ ]:
df_dinnerparty.head(20)

# step 8

In [ ]:
df_dinnerparty.shape

# step 9

In [ ]:
df_user1 = df_ords[df_ords['user_id'] == '1']

In [ ]:
df_user1.head(20)

# step 10

In [ ]:
df_user1.describe()

# step 11

In [23]:
df_ords.head(5)

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,<NA>
1,2398795,1,2,3,7,15
2,473747,1,3,3,12,21
3,2254736,1,4,4,7,29
4,431534,1,5,4,15,28

In [ ]:
df_ords.to_csv(os.path.join(path, 'Prepared Data', 'orders_wrangled.csv'))

In [ ]:
df_dpts_new.to_csv(os.path.join(path,'Prepared Data', 'departments_wrangled.csv'))

###